Revit 2027 API
PropertyTableEntry.Id Property
 Unique identifier for this PropertyTableEntry
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public int Id { get; set; }
Public Property Id As Integer
	Get
	Set
public:
property int Id {
	int get ();
	void set (int value);
}
member Id : int with get, set
Property Value
Int32
See Also
Reference
PropertyTableEntry Class
Autodesk.Revit.DB Namespace